## Staging: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/forms-terraform/actions/runs/6948450657).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # aws_cloudwatch_event_rule.cron_2am_every_day will be created
  + resource "aws_cloudwatch_event_rule" "cron_2am_every_day" {
      + arn                 = (known after apply)
      + description         = "Fires every day at 2am EST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "every-day-at-2am"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 7 * * ? *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_rule.cron_3am_every_day will be created
  + resource "aws_cloudwatch_event_rule" "cron_3am_every_day" {
      + arn                 = (known after apply)
      + description         = "Fires every day at 3am EST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "every-day-at-3am"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 8 * * ? *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_rule.cron_4am_every_day will be created
  + resource "aws_cloudwatch_event_rule" "cron_4am_every_day" {
      + arn                 = (known after apply)
      + description         = "Fires every day at 4am EST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "every-day-at-4am"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 9 * * ? *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_rule.cron_5am_every_business_day will be created
  + resource "aws_cloudwatch_event_rule" "cron_5am_every_business_day" {
      + arn                 = (known after apply)
      + description         = "Fires every business day at 5am EST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "every-business-day-at-5am"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 10 ? * MON-FRI *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.run_archive_form_responses_lambda_every_day will be created
  + resource "aws_cloudwatch_event_target" "run_archive_form_responses_lambda_every_day" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "every-day-at-3am"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.run_archive_form_templates_lambda_every_day will be created
  + resource "aws_cloudwatch_event_target" "run_archive_form_templates_lambda_every_day" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "every-day-at-4am"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.run_dead_letter_queue_consumer_lambda_every_day will be created
  + resource "aws_cloudwatch_event_target" "run_dead_letter_queue_consumer_lambda_every_day" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "every-day-at-2am"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.run_nagware_lambda_every_day will be created
  + resource "aws_cloudwatch_event_target" "run_nagware_lambda_every_day" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "every-business-day-at-5am"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_log_group.audit_logs must be replaced
  # (imported from "/aws/lambda/AuditLogs")
  # Warning: this will destroy the imported resource
-/+ resource "aws_cloudwatch_log_group" "audit_logs" {
      ~ arn               = "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/AuditLogs" -> (known after apply)
      ~ id                = "/aws/lambda/AuditLogs" -> (known after apply)
        kms_key_id        = "arn:aws:kms:ca-central-1:687401027353:key/c5c2a1c2-c092-4fa1-8daf-3414f3511b1d"
      ~ name              = "/aws/lambda/AuditLogs" -> "/aws/lambda/Audit_Logs" # forces replacement
        retention_in_days = 90
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
    }

  # aws_cloudwatch_log_group.dead_letter_queue_consumer must be replaced
  # (imported from "/aws/lambda/DeadLetterQueueConsumer")
  # Warning: this will destroy the imported resource
-/+ resource "aws_cloudwatch_log_group" "dead_letter_queue_consumer" {
      ~ arn               = "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/DeadLetterQueueConsumer" -> (known after apply)
      ~ id                = "/aws/lambda/DeadLetterQueueConsumer" -> (known after apply)
        kms_key_id        = "arn:aws:kms:ca-central-1:687401027353:key/c5c2a1c2-c092-4fa1-8daf-3414f3511b1d"
      ~ name              = "/aws/lambda/DeadLetterQueueConsumer" -> "/aws/lambda/Reliability_DLQ_Consumer" # forces replacement
        retention_in_days = 90
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
    }

  # aws_cloudwatch_log_group.nagware will be imported
    resource "aws_cloudwatch_log_group" "nagware" {
        arn               = "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/Nagware"
        id                = "/aws/lambda/Nagware"
        kms_key_id        = "arn:aws:kms:ca-central-1:687401027353:key/c5c2a1c2-c092-4fa1-8daf-3414f3511b1d"
        name              = "/aws/lambda/Nagware"
        retention_in_days = 90
        tags              = {}
        tags_all          = {}
    }

  # aws_cloudwatch_log_group.reliability will be imported
    resource "aws_cloudwatch_log_group" "reliability" {
        arn               = "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/Reliability"
        id                = "/aws/lambda/Reliability"
        kms_key_id        = "arn:aws:kms:ca-central-1:687401027353:key/c5c2a1c2-c092-4fa1-8daf-3414f3511b1d"
        name              = "/aws/lambda/Reliability"
        retention_in_days = 90
        tags              = {}
        tags_all          = {}
    }

  # aws_cloudwatch_log_group.response_archiver must be replaced
  # (imported from "/aws/lambda/Archiver")
  # Warning: this will destroy the imported resource
-/+ resource "aws_cloudwatch_log_group" "response_archiver" {
      ~ arn               = "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/Archiver" -> (known after apply)
      ~ id                = "/aws/lambda/Archiver" -> (known after apply)
        kms_key_id        = "arn:aws:kms:ca-central-1:687401027353:key/c5c2a1c2-c092-4fa1-8daf-3414f3511b1d"
      ~ name              = "/aws/lambda/Archiver" -> "/aws/lambda/Response_Archiver" # forces replacement
        retention_in_days = 90
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
    }

  # aws_cloudwatch_log_group.submission will be imported
    resource "aws_cloudwatch_log_group" "submission" {
        arn               = "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/Submission"
        id                = "/aws/lambda/Submission"
        kms_key_id        = "arn:aws:kms:ca-central-1:687401027353:key/c5c2a1c2-c092-4fa1-8daf-3414f3511b1d"
        name              = "/aws/lambda/Submission"
        retention_in_days = 90
        tags              = {}
        tags_all          = {}
    }

  # aws_cloudwatch_log_group.vault_integrity must be replaced
  # (imported from "/aws/lambda/VaultDataIntegrityCheck")
  # Warning: this will destroy the imported resource
-/+ resource "aws_cloudwatch_log_group" "vault_integrity" {
      ~ arn               = "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/VaultDataIntegrityCheck" -> (known after apply)
      ~ id                = "/aws/lambda/VaultDataIntegrityCheck" -> (known after apply)
        kms_key_id        = "arn:aws:kms:ca-central-1:687401027353:key/c5c2a1c2-c092-4fa1-8daf-3414f3511b1d"
      ~ name              = "/aws/lambda/VaultDataIntegrityCheck" -> "/aws/lambda/Vault_Data_Integrity_Check" # forces replacement
        retention_in_days = 90
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
    }

  # aws_iam_policy.lambda_dynamodb will be created
  + resource "aws_iam_policy" "lambda_dynamodb" {
      + arn         = (known after apply)
      + description = "IAM policy for storing Form responses in DynamoDB"
      + id          = (known after apply)
      + name        = "lambda_dynamobdb"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:PutItem",
                          + "dynamodb:ListStreams",
                          + "dynamodb:GetShardIterator",
                          + "dynamodb:GetRecords",
                          + "dynamodb:GetItem",
                          + "dynamodb:DescribeStream",
                          + "dynamodb:DeleteItem",
                          + "dynamodb:BatchWriteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:ca-central-1:687401027353:table/Vault/stream/2023-10-30T19:33:04.980",
                          + "arn:aws:dynamodb:ca-central-1:687401027353:table/Vault/index/*",
                          + "arn:aws:dynamodb:ca-central-1:687401027353:table/Vault",
                          + "arn:aws:dynamodb:ca-central-1:687401027353:table/ReliabilityQueue",
                          + "arn:aws:dynamodb:ca-central-1:687401027353:table/AuditLogs/index/*",
                          + "arn:aws:dynamodb:ca-central-1:687401027353:table/AuditLogs",
                        ]
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_kms will be created
  + resource "aws_iam_policy" "lambda_kms" {
      + arn         = (known after apply)
      + description = "IAM policy for storing encrypting and decrypting data"
      + id          = (known after apply)
      + name        = "lambda_kms"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:GenerateDataKey",
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:kms:ca-central-1:687401027353:key/c5c2a1c2-c092-4fa1-8daf-3414f3511b1d",
                          + "arn:aws:kms:ca-central-1:687401027353:key/1f3edb85-9eac-4da9-8c7c-43a68e339ede",
                        ]
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn         = (known after apply)
      + description = "IAM policy for logging from a lambda"
      + id          = (known after apply)
      + name        = "lambda_logging"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_rds will be created
  + resource "aws_iam_policy" "lambda_rds" {
      + arn         = (known after apply)
      + description = "IAM policy for allowing acces to DB"
      + id          = (known after apply)
      + name        = "lambda_rds"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "tag:GetResources",
                          + "secretsmanager:ListSecrets",
                          + "secretsmanager:GetRandomPassword",
                          + "secretsmanager:CreateSecret",
                          + "rds-data:RollbackTransaction",
                          + "rds-data:ExecuteStatement",
                          + "rds-data:ExecuteSql",
                          + "rds-data:CommitTransaction",
                          + "rds-data:BeginTransaction",
                          + "rds-data:BatchExecuteStatement",
                          + "dbqms:UpdateQueryHistory",
                          + "dbqms:UpdateFavoriteQuery",
                          + "dbqms:GetQueryString",
                          + "dbqms:DescribeQueryHistory",
                          + "dbqms:DescribeFavoriteQueries",
                          + "dbqms:DeleteQueryHistory",
                          + "dbqms:DeleteFavoriteQueries",
                          + "dbqms:CreateQueryHistory",
                          + "dbqms:CreateFavoriteQuery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "RDSDataServiceAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_s3 will be created
  + resource "aws_iam_policy" "lambda_s3" {
      + arn         = (known after apply)
      + description = "IAM policy for storing files in S3"
      + id          = (known after apply)
      + name        = "lambda_s3"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "/*",
                          + "",
                        ]
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_secrets will be created
  + resource "aws_iam_policy" "lambda_secrets" {
      + arn         = (known after apply)
      + description = "IAM policy for accessing secret manager"
      + id          = (known after apply)
      + name        = "lambda_secrets"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:ca-central-1:687401027353:secret:database-secret-vHJuTe",
                          + "",
                        ]
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_sns will be created
  + resource "aws_iam_policy" "lambda_sns" {
      + arn         = (known after apply)
      + description = "IAM policy for allowing lambda to publish message in SNS for Slack notification"
      + id          = (known after apply)
      + name        = "lambda_sns"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sns:Publish"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sns:ca-central-1:687401027353:alert-critical"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_sqs will be created
  + resource "aws_iam_policy" "lambda_sqs" {
      + arn         = (known after apply)
      + description = "IAM policy for sending messages through SQS"
      + id          = (known after apply)
      + name        = "lambda_sqs"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sqs:SendMessage",
                          + "sqs:ReceiveMessage",
                          + "sqs:GetQueueAttributes",
                          + "sqs:DeleteMessage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sqs:*:*:*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.lambda will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iam_for_lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaVPCAccessExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_dynamodb will be created
  + resource "aws_iam_role_policy_attachment" "lambda_dynamodb" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_kms will be created
  + resource "aws_iam_role_policy_attachment" "lambda_kms" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_rds will be created
  + resource "aws_iam_role_policy_attachment" "lambda_rds" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_s3 will be created
  + resource "aws_iam_role_policy_attachment" "lambda_s3" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_secrets will be created
  + resource "aws_iam_role_policy_attachment" "lambda_secrets" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_sns will be created
  + resource "aws_iam_role_policy_attachment" "lambda_sns" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_sqs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_sqs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_lambda_event_source_mapping.audit_logs will be created
  + resource "aws_lambda_event_source_mapping" "audit_logs" {
      + batch_size                         = 10
      + enabled                            = true
      + event_source_arn                   = "arn:aws:sqs:ca-central-1:687401027353:audit_log_queue"
      + function_arn                       = (known after apply)
      + function_name                      = (known after apply)
      + function_response_types            = [
          + "ReportBatchItemFailures",
        ]
      + id                                 = (known after apply)
      + last_modified                      = (known after apply)
      + last_processing_result             = (known after apply)
      + maximum_batching_window_in_seconds = 30
      + maximum_record_age_in_seconds      = (known after apply)
      + maximum_retry_attempts             = (known after apply)
      + parallelization_factor             = (known after apply)
      + state                              = (known after apply)
      + state_transition_reason            = (known after apply)
      + uuid                               = (known after apply)
    }

  # aws_lambda_event_source_mapping.reliability will be created
  + resource "aws_lambda_event_source_mapping" "reliability" {
      + batch_size                    = 1
      + enabled                       = true
      + event_source_arn              = "arn:aws:sqs:ca-central-1:687401027353:submission_processing.fifo"
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # aws_lambda_event_source_mapping.reprocess_submission will be created
  + resource "aws_lambda_event_source_mapping" "reprocess_submission" {
      + batch_size                    = 1
      + enabled                       = true
      + event_source_arn              = "arn:aws:sqs:ca-central-1:687401027353:reprocess_submission_queue.fifo"
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # aws_lambda_event_source_mapping.vault_updated_item_stream will be created
  + resource "aws_lambda_event_source_mapping" "vault_updated_item_stream" {
      + enabled                            = true
      + event_source_arn                   = "arn:aws:dynamodb:ca-central-1:687401027353:table/Vault/stream/2023-10-30T19:33:04.980"
      + function_arn                       = (known after apply)
      + function_name                      = (known after apply)
      + id                                 = (known after apply)
      + last_modified                      = (known after apply)
      + last_processing_result             = (known after apply)
      + maximum_batching_window_in_seconds = 60
      + maximum_record_age_in_seconds      = (known after apply)
      + maximum_retry_attempts             = 3
      + parallelization_factor             = (known after apply)
      + starting_position                  = "LATEST"
      + state                              = (known after apply)
      + state_transition_reason            = (known after apply)
      + uuid                               = (known after apply)

      + filter_criteria {
          + filter {
              + pattern = jsonencode(
                    {
                      + eventName = [
                          + "INSERT",
                          + "MODIFY",
                        ]
                    }
                )
            }
        }
    }

  # aws_lambda_function.audit_logs will be created
  + resource "aws_lambda_function" "audit_logs" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "Audit_Logs"
      + handler                        = "audit_logs.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs18.x"
      + s3_bucket                      = "placeholder"
      + s3_key                         = "audit_logs_code"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "/R1wM/BAe0krJb4Vv4a7hU3SbtXvDxSpWg0WihA5KPc="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  =...
```

</details>

